Revit 2024 API
RevitLinkOptions Constructor (RevitLinkOptions)
 Constructs a new copy of the input RevitLinkOptions object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public RevitLinkOptions(
	RevitLinkOptions other
)
Visual Basic
Public Sub New ( _
	other As RevitLinkOptions _
)
Visual C++
public:
RevitLinkOptions(
	RevitLinkOptions^ other
)
Parameters
other
Type: Autodesk.Revit.DB.RevitLinkOptions
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RevitLinkOptions Class
RevitLinkOptions Overload
Autodesk.Revit.DB Namespace